#include<stdio.h>
int main(void)
{
	int a[3][4] = { 1,3,5,7,9,11,13,15,17,19,21,23 };
	printf("%d,%d\n", a, *a);//a是行指针，*a是列指针
	printf("%d,%d\n", a[0], *(a + 0));//两个列指针
	printf("%d,%d\n", &a[0], &a[0][0]);//a+0 ,*(a+0)+0 地址一样，指向的类型不同
	printf("%d,%d\n", a[1], a + 1);//*(a+1)列指针 (a+1)行指针
	printf("%d,%d\n", &a[1][0], *(a + 1) + 0);//*(a+1)+0列指针 
	printf("%d,%d\n", a[2], *(a + 2));//*(a+2)列指针
	printf("%d,%d\n", &a[2], a + 2);//a+2 行指针
	printf("%d,%d\n", a[1][0], *(*(a + 1) + 0));//列指针
	printf("%d,%d\n", a[2], *(*(a + 2) + 0));//*(a+2)行指针 a[2][2]列指针
	return	0;
}
/*
运行结果
9698508, 9698508
9698508, 9698508
9698508, 9698508
9698524, 9698524
9698524, 9698524
9698540, 9698540
9698540, 9698540
9, 9
9698540, 17
*/